Documents/ПланПроизводства/ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПроизводства</name>
  <comment>(Упр)</comment>
  <basedOn>Document.ПланПроизводства</basedOn>
  <registerRecords>AccumulationRegister.ПланыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.Лео_ПланыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПроизводственнаяПрограмма</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиПомощникаПланирования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидПланаПроизводства</name>
    <type>
      <types>EnumRef.абс_ВидыПлановПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлана</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.ПланПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантРаспределения</name>
      <type>
        <types>EnumRef.ВариантыРаспределенияПоПериоду</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.СпецификацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзИсточника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>лео_Оборудование</name>
      <type>
        <types>CatalogRef.Лео_оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>лео_Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ЭтоРаспоряжение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_РаспоряжениеНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>CatalogRef.Лео_РаспоряженияНаВыпуск</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизводственнаяПрограмма</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.ПланПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.СпецификацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВоспроизводства</name>
      <type>
        <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантРаспределения</name>
      <type>
        <types>EnumRef.ВариантыРаспределенияПоПериоду</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/ПланПроизводства/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("ПланПроизводства_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	Если Объект.ПериодичностьДетализации = Перечисления.Периодичность.ПустаяСсылка() Тогда
		ТекущаяПериодичность = Перечисления.Периодичность.День;
	Иначе
		ТекущаяПериодичность = Объект.ПериодичностьДетализации;
	КонецЕсли;
	Если Объект.Сценарий.Периодичность = Перечисления.Периодичность.ПустаяСсылка() Тогда
		ПеиодичностьПлана = Перечисления.Периодичность.Год;
	Иначе
		ПериодичностьПлана = Объект.Сценарий.Периодичность;
	КонецЕсли;
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дПериодПланирования = НачалоДня(обОбъект.ДатаПланирования);
	
	Макет = Документы.ПланПроизводства.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаКлиентНоменклатура 	= Макет.ПолучитьОбласть("Шапка|КлиентНоменклатура");
	ОбластьШапкаПериод 				= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаКлиентНоменклатура = Макет.ПолучитьОбласть("Строка|КлиентНоменклатура");
	ОбластьСтрокаПериод			 	= Макет.ПолучитьОбласть("Строка|Период");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаКлиентНоменклатура);
	
	НачалоПериода = Объект.ДатаПланирования;
	КонецПериода = Объект.ДатаПланирования;
	
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(НачалоПериода, ПериодичностьПлана);
	УправлениеПланированием.ВыровнятьДатуПоКонцуПериода(КонецПериода, ПериодичностьПлана);
	
	КоличествоДнейВПериоде = (НачалоДня(КонецПериода) - НачалоПериода)/86400 + 1;
	
	МассивПериодов = Новый Массив;
	
	Для Сч = 0 По КоличествоДнейВПериоде-1 Цикл
		Период = НачалоПериода + Сч * 86400;
		УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Период, ТекущаяПериодичность);
		Если МассивПериодов.Найти(Период) = Неопределено Тогда
			ОбластьШапкаПериод.Параметры.Период = Период;		
			ТабДок.Присоединить(ОбластьШапкаПериод);		
			МассивПериодов.Добавить(Период);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПроизводстваСоставПлана.Период КАК Период,
		|	ПланПроизводстваСоставПлана.Номенклатура КАК Номенклатура,
		|	ПланПроизводстваСоставПлана.Номенклатура.Артикул КАК Артикул,
		|	ПланПроизводстваСоставПлана.Количество КАК Количество
		|ИЗ
		|	Документ.ПланПроизводства.СоставПлана КАК ПланПроизводстваСоставПлана
		|ГДЕ
		|	ПланПроизводстваСоставПлана.Ссылка = &Ссылка
		|	И ПланПроизводстваСоставПлана.Номенклатура ССЫЛКА Справочник.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура,
		|	Период ПЕРИОДАМИ("+Строка(ТекущаяПериодичность)+", &НачПериода, &КонПериода)";

	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);

	Результат = Запрос.Выполнить();

	ВыборкаКлиентНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаКлиентНоменклатура.Следующий() Цикл
		
		ОбластьСтрокаКлиентНоменклатура.Параметры.Заполнить(ВыборкаКлиентНоменклатура);
	  	ТабДок.Вывести(ОбластьСтрокаКлиентНоменклатура);

		ВыборкаПериод = ВыборкаКлиентНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

		Пока ВыборкаПериод.Следующий() Цикл
			ОбластьСтрокаПериод.Параметры.Заполнить(ВыборкаПериод);
			ТабДок.Присоединить(ОбластьСтрокаПериод);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
